CSI API ETABS v1
cDCoACI318_14.GetOverwrite Method
 Retrieves the value of a concrete design overwrite item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOverwrite(
	string Name,
	int Item,
	ref double Value,
	ref bool ProgDet
)
Function GetOverwrite (
	Name As String,
	Item As Integer,
	ByRef Value As Double,
	ByRef ProgDet As Boolean
) As Integer
Dim instance As cDCoACI318_14
Dim Name As String
Dim Item As Integer
Dim Value As Double
Dim ProgDet As Boolean
Dim returnValue As Integer
returnValue = instance.GetOverwrite(Name,
	Item, Value, ProgDet)
int GetOverwrite(
	String^ Name,
	int Item,
	double% Value,
	bool% ProgDet
)
abstract GetOverwrite :
        Name : string *
        Item : int *
        Value : float byref *
        ProgDet : bool byref -> int
Parameters
Name
Type: System.String
 The name of a frame object with a concrete frame design procedure.
Item
Type: System.Int32
 This is an integer between 1 and 13, inclusive, indicating the overwrite item considered.
Framing type
Live load reduction factor
Unbraced length ratio, Major
Unbraced length ratio, Minor
Effective length factor, K Major
Effective length factor, K Minor
Moment coefficient, Cm Major
Moment coefficient, Cm Minor
Nonsway moment factor, Db Major
Nonsway moment factor, Db Minor
Sway moment factor, Ds Major
Sway moment factor, Ds Minor
Consider Minimum Eccentricity
Value
Type: System.Double
 The value of the considered overwrite item.
 Framing type
0 = Program Default
1 = Sway special
2 = Sway Intermediate
3 = Sway Ordinary
4 = Non-sway
 Live load reduction factor
 Value >= 0; 0 means use program determined value
 Unbraced length ratio, Major
 Value >= 0; 0 means use program determined value
 Unbraced length ratio, Minor
 Value >= 0; 0 means use program determined value
 Effective length factor, K Major
 Value >= 0; 0 means use program determined value
 Effective length factor, K Minor
 Value >= 0; 0 means use program determined value
 Moment coefficient, Cm Major
 Value >= 0; 0 means use program determined value
 Moment coefficient, Cm Minor
 Value >= 0; 0 means use program determined value
 Nonsway moment factor, Db Major
 Value >= 0; 0 means use program determined value
 Nonsway moment factor, Db Minor
 Value >= 0; 0 means use program determined value
 Sway moment factor, Ds Major
 Value >= 0; 0 means use program determined value
 Sway moment factor, Ds Minor
 Value >= 0; 0 means use program determined value
 Consider Minimum Eccentricity
 0 = No
 Any other value = Yes
ProgDet
Type: System.Boolean
 If this item is True, the specified value is program determined.
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'create new concrete frame section property
   ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
'set frame section property
   ret = SapModel.FrameObj.SetSection("8", "R1")
'set concrete design code
   ret = SapModel.DesignConcrete.SetCode("ACI 318-14")
'run analysis
   System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
   ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
   ret = SapModel.Analyze.RunAnalysis
'start concrete design
   ret = SapModel.DesignConcrete.StartDesign()
'get overwrite item
   ret = SapModel.DesignConcrete.ACI318_14.GetOverwrite("8", 1, Value, ProgDet)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCoACI318_14 Interface
ETABSv1 Namespace